app/views/things/index.html.erb


						<% if !thing.notes.empty? %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."thing_id" IN (169, 168, 167, 59, 132, 144, 166, 165, 164, 163, 162, 161, 157, 61, 156)
SELECT COUNT(*) FROM "notes" WHERE "notes"."thing_id" = 148