app/views/shared/_chart.html.erb

<% @typ.each do |t| %>
	<% mydata[i] = t.things.count.to_i %>
---
SELECT COUNT(*) FROM "things" WHERE (favorite = 't')