app/views/shared/_show_types.html.erb

SELECT "types".* FROM "types" WHERE (user_id=1) ORDER BY updated_at DESC
---
<% @types = Type.all %>