app/controllers/notes_controller.rb

INSERT INTO "notes" ("created_at", "note_text", "thing_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @note = Note.new(params[:note])
    @note.user_id = current_user.id

    respond_to do |format|
      if @note.save