app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings" WHERE (user_id=1)
---
  def index
    @settings = Setting.find(:all, :conditions => ["user_id=?", current_user.id])

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "5"]]
---
  def show
#    @setting = Setting.find(params[:id])
    @setting = Setting.find(params[:id])

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @setting = Setting.find(params[:id])

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "settings" SET "rowcountperpage" = 150, "updated_at" = '2012-08-16 13:18:13.853276' WHERE "settings"."id" = 5
---
  def update
    @setting = Setting.find(params[:id])

    respond_to do |format|
      if @setting.update_attributes(params[:setting])