app/controllers/things_controller.rb

  def index
    # @things = Thing.all

    @setting = Setting.find(:all, :conditions => ["user_id=?", current_user.id])
    @things = Thing.paginate :include => :notes, :conditions => ["user_id=?", current_user.id],
                             :page => params[:page], :per_page => @setting.first.rowcountperpage, :order => 'updated_at DESC'
---
SELECT "settings".* FROM "settings" WHERE (user_id=1)
SELECT "notes".* FROM "notes" WHERE "notes"."thing_id" IN (169, 168, 167, 59, 132, 144, 166, 165, 164, 163, 162, 161, 157, 61, 156)
SELECT "things".* FROM "things" WHERE (user_id=1) AND (short_name LIKE '%error%' or long_name LIKE '%error%' or type_id in (4)) ORDER BY type_id, created_at asc LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "notes" WHERE "notes"."thing_id" = 61
SELECT COUNT(*) FROM "things" WHERE (user_id=1) AND (short_name LIKE '%to do%' or long_name LIKE '%to do%' or type_id in (7))

  def show
    @thing = Thing.find(params[:id])
---
SELECT "things".* FROM "things" WHERE "things"."id" = ? LIMIT 1  [["id", "162"]]

  def edit
    @thing = Thing.find(params[:id])
---
SELECT "things".* FROM "things" WHERE "things"."id" = ? LIMIT 1  [["id", "162"]]

  def create
    @thing = Thing.new(params[:thing])
    @thing.user_id = current_user.id


    respond_to do |format|
      if @thing.save
---
INSERT INTO "things" ("created_at", "favorite", "long_name", "short_name", "thing_parent_id", "type_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @thing = Thing.find(params[:id])

    respond_to do |format|
      if @thing.update_attributes(params[:thing])
---
SELECT "things".* FROM "things" WHERE "things"."id" = ? LIMIT 1  [["id", "162"]]
UPDATE "things" SET "short_name" = 'Add filters on Types and Dates', "long_name" = 'For instance, you make a phone call to someone, then add it as a thing, with type "Phonecall". Then you can sort and say give me all the phone calls made last week wednesday, and it brings them up! Or you can just filter on a type (checkbox?)', "favorite" = 't', "updated_at" = '2012-08-16 13:35:29.992537' WHERE "things"."id" = 121

  def destroy
    @thing = Thing.find(params[:id])
    @thing.destroy
---
SELECT "things".* FROM "things" WHERE "things"."id" = ? LIMIT 1  [["id", "170"]]
DELETE FROM "things" WHERE "things"."id" = ?  [["id", 170]]