app/controllers/types_controller.rb

SELECT "settings".* FROM "settings" WHERE (user_id=1)
SELECT "types".* FROM "types" WHERE (user_id=1) ORDER BY updated_at desc LIMIT 150 OFFSET 0
SELECT COUNT(*) FROM "types" WHERE (user_id=1)
---
  def index
    @setting = Setting.find(:all, :conditions => ["user_id=?", current_user.id])

    @types = Type.paginate :conditions => ["user_id=?", current_user.id], :page => params[:page], :per_page => @setting.first.rowcountperpage, :order => (sort_column + ' ' + sort_direction) #'updated_at DESC'

SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", "43"]]
---
  def show
    @type = Type.find(params[:id])

INSERT INTO "types" ("created_at", "long_lebel", "short_label", "type_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 17 Aug 2012 08:01:09 UTC +00:00], ["long_lebel", nil], ["short_label", nil], ["type_name", "Problem"], ["updated_at", Fri, 17 Aug 2012 08:01:09 UTC +00:00], ["user_id", 1]]
---
  def create
    @type = Type.new(params[:type])
    @type.user_id = current_user.id

    respond_to do |format|
      if @type.save