app/views/layouts/_header.html.erb

SELECT "settings".* FROM "settings" WHERE (user_id=1)
---

			<% @setting = Setting.find(:all, :conditions => ["user_id=?", current_user.id]) %> <!-- SHAUN change this to be conditional and not load every time -->